myT9_29_作業途中/app/views/user/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "frends".* FROM "frends" WHERE "frends"."user_id" = ?  [["user_id", 1]]
---
          <img src="/<%=@rd[i].frend_image%>" alt="<%=@rd[i].frend_name%>">
          <p><%=User.find_by(id:@rd[i].frend_id).name%></p>