myT9_28_途中経過/app/controllers/borad_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def chat_index
    @user= User.find_by(id: params[:id])

INSERT INTO "borads" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "hoge"], ["description", "hugahuga"], ["created_at", "2017-08-27 09:01:54.465033"], ["updated_at", "2017-08-27 09:01:54.465033"]]
---
  def form_create
    @name=params[:name]
    @description=params[:description]
    @borad=Borad.new(name: @name,description: @description)
    if @borad
      @borad.save

SELECT "borads".* FROM "borads"
---
  def index
    @borad=Borad.all

SELECT  "borads".* FROM "borads" WHERE "borads"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    @borad=Borad.find_by(id: params[:id])

SELECT  "borads".* FROM "borads" WHERE "borads"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "borads" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "borads"."id" = ?  [["name", "挨拶"], ["description", "説明"], ["updated_at", "2017-08-27 08:44:48.386148"], ["id", 1]]
---
  def update_result
    @borad=Borad.find_by(id: params[:id])
    @borad.name=params[:name]
    @borad.description=params[:description]
    if @borad
      @borad.save