myT9_26_共有用/app/views/user/show.html.erb

            <%@frend.each do|i|%>
              <%j=User.find_by(id:i.frend_user)%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "frends".* FROM "frends" WHERE "frends"."user_id" = ?  [["user_id", 1]]