myT9_29_作業途中/app/controllers/user_controller.rb

  def show
    @user=User.find_by(id: params[:id])
    @tag=Taguser.where(name: @user.name)
    @frend=Frend.where(user_id: @user.id)
    @rf=RelationFrend.find_by(user_id:@user.id)
    @rd=RelationDetail.where(user_id:1)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tagusers".* FROM "tagusers" WHERE "tagusers"."name" = ?  [["name", "garchomp"]]
SELECT "frends".* FROM "frends" WHERE "frends"."user_id" = ?  [["user_id", 1]]
SELECT  "relation_frends".* FROM "relation_frends" WHERE "relation_frends"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "relation_details".* FROM "relation_details" WHERE "relation_details"."user_id" = ?  [["user_id", 1]]

  def login_form
    @user=User.find_by(email: params[:email],password: params[:password])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" = ? LIMIT ?  [["email", "hoge"], ["password", "hoge"], ["LIMIT", 1]]