app/views/user/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "frends".* FROM "frends" WHERE "frends"."user_id" = ?  [["user_id", 1]]
---
      <%for i in 0..@rd.size-1 do%>
      <%@r_user=User.find_by(id:@rd[i].frend_id)%>