myT9_26_共有用/app/controllers/user_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tagusers".* FROM "tagusers" WHERE "tagusers"."name" = ?  [["name", "garchomp"]]
SELECT "frends".* FROM "frends" WHERE "frends"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user=User.find_by(id: params[:id])
    @tag=Taguser.where(name: @user.name)
    @frend=Frend.where(user_id:1)

SELECT  "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" = ? LIMIT ?  [["email", "hoge"], ["password", "hoge"], ["LIMIT", 1]]
---
  def login_form
    @user=User.find_by(email: params[:email],password: params[:password])