app/controllers/mypage_controller.rb

  def hide_setting
    @hide_setting=HideSetting.find_by(user_id: params[:id])
    @hide_word=HideWord.where(user_id: params[:id])
---
SELECT  `hide_settings`.* FROM `hide_settings` WHERE `hide_settings`.`user_id` = 1 LIMIT 1
SELECT `hide_words`.* FROM `hide_words` WHERE `hide_words`.`user_id` = 1

  def hide_setting_form_ng_word
    @hide_word = HideWord.new(user_id: params[:id],hide_word: params[:ng_word_name])
    respond_to do |format|
      @hide_word.save
---
INSERT INTO `hide_words` (`user_id`, `hide_word`, `created_at`, `updated_at`) VALUES (1, 'dfas', '2017-11-07 13:38:30', '2017-11-07 13:38:30')