app/views/mypage/relation.html.erb

              <%for i in 0..@character.size-1 do%>
                <%@character_user=User.find_by(id: @character[i].character_id)%>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

            <%for i in 0..@frend.size-1 do%>
              <%@frend_user=User.find_by(id: @frend[i].frend_user)%>
---
SELECT `frends`.* FROM `frends` WHERE `frends`.`user_id` = 1